<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr">
    <head>
    	<link href="style.css" rel="stylesheet" type="text/css"/>
    	<meta http-equiv="content-type" content="text/html; charset=utf-8" />
    	<link rel="shortcut icon" type="image/x-icon" href="images/favicon.ico" />
	    <title>Laboratoire d'Ing&eacute;nierie des Syst&egrave;mes Automatis&eacute;s</title>
	    
		<!--[if lte IE 8]>
			<script src="http://html5shiv.googlecode.com/svn/trunk/html5.js"></script>
		<![endif]-->

    </head>
    
    <body>
	    <a id="_top"></a>
		<div id="global">
			<header>
				<ul>
					<li><a href="index.html">Accueil</a></li>
					<li id="current"><a href="#">Projet</a></li>
					<li><a href="galerie.html">Galerie</a></li>
					<li><a href="rapports.html">Rapports</a></li>
				</ul>
				<hr />
			</header>
		
			<div id="contenu">
				<div id="introduction">
					<div id="sommaire">
						<h4>SOMMAIRE</h4>
						<ol>
							<li><a href="#_partie_1">&Eacute;tat de l'art</a></li>
							<li><a href="#_partie_2">Vectorisation de la carte 2D</a></li>
							<li><a href="#_partie_3">Recherche de zones</a></li>
							<li><a href="#_partie_4">Extraction des sols et murs en 3D</a></li>
							<li><a href="#_partie_5">Semaine de d&eacute;fi</a></li>
							<li><a href="#_partie_6">Autres travaux</a></li>
						</ol>
					</div>
					<p>
					Cette partie va maintenant pr&eacute;senter les diff&eacute;rents travaux qui ont &eacute;t&eacute; effectu&eacute; pendant le stage. Chaque grande &eacute;tape sera repr&eacute;sent&eacute;e dans une section, mais cela ne signifie pas pour autant qu'elle est ind&eacute;pendante des autres.
					</p>
					<p> L'aboutissement de ce stage est en partie repr&eacute;sent&eacute; par le d&eacute;fi <abbr title="CArtographie par ROboT d'un TErritoire">Carotte</abbr> qui s'est d&eacute;roul&eacute; du 4 au 8 juin 2012. Le but de ce d&eacute;fi est de r&eacute;aliser la cartographie d'un espace ferm&eacute; de 120m&sup2; et d'identifier et localiser des objets dans cet espace. Ce concours est g&eacute;r&eacute; par la <abbr title="Direction G&eacute;n&eacute;rale de l'Armement">DGA</abbr> et l'<abbr title="Agence Nationale pour la Recherche">ANR</abbr>. Il se d&eacute;roulait sur trois ans. Le travail au sein du laboratoire a &eacute;t&eacute; r&eacute;parti entre deux laboratoires, le <abbr title="Laboratoire d'Ing&eacute;nierie des Syst&egrave;mes Automatis&eacute;s">LISA</abbr> &agrave;  Angers et le <abbr title="Laboratoire LOrrain de Recherche en Informatique et ses Applications">LORIA</abbr> &agrave;  Nancy. Pour cette derni&egrave;re ann&eacute;e, l'&eacute;quipe est fi&egrave;re d'annoncer une premi&egrave;re place au concours !
					</p>
				</div>
				<span class="clear"></span>
				<section>
					<a id="_partie_1"></a>
					<h3 class="titre">1. &Eacute;tat de l'art <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
					<p>
					Dans un premier temps, une recherche a &eacute;t&eacute; faite afin de faire l'inventaire sur les techniques et algorithmes correspondant aux probl&egrave;mes de la reconnaissance de plan et d'objets. Cette recherche a permis d'identifier plusieurs solutions possibles qui sont list&eacute;es ci-dessous. En gras sont mis en &eacute;vidence les algorithmes ayant un lien partiel ou total avec la r&eacute;solution finale.
					</p>
					Reconnaissance de plans :
					<ul>
						<li><b>Transformation de Hough</b></li>
						<li><abbr title="RANdom SAmple Consensus">RANSAC</abbr></li>
						<li>Division - fusion</li>
						<li><b>Croissance de surfaces</b></li>
					</ul>
					Reconnaissance d'objets :
					<ul>
						<li>&agrave;€ partir d'images 2D</li>
						<li><b>D&eacute;tection de caract&eacute;ristiques</b></li>
						<li>Approche g&eacute;om&eacute;trique</li>
						<li><b>Utilisation de caract&eacute;ristiques cl&eacute;s</b></li>
					</ul>
					<p>
					Cette phase pr&eacute;c&eacute;dant le travail de d&eacute;veloppement s'est d&eacute;roul&eacute;e durant les mois de projets de la formation d'ing&eacute;nieur. Elle s'est conclut par un rapport et une soutenance mi-f&eacute;vrier 2012.
					</p>
				</section>
				
				<section>
					<a id="_partie_2"></a>
					<h3 class="titre">2. Vectorisation de la carte 2D <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
						<table id="hough">
							<tr><td>
								<img src="images/image_bruit.png" alt="image bruit&eacute;e"/>
							</td></tr>
							<tr><td>
								<img src="images/murs_debruite.png" alt="image d&eacute;bruit&eacute;e"/>
							</td></tr>
							<tr><td>
								<img src="images/murs_vectorise.png" alt="image vectoris&eacute;e"/>
							</td></tr>
						</table>
						<h4>Extraction des murs</h4>
						<p>
						La premi&egrave;re t&acirc;che qui m'a &eacute;t&eacute; demand&eacute; a &eacute;t&eacute; de r&eacute;aliser une identification des murs dans une carte 2D. Conform&eacute;ment au r&egrave;glement, un mur peut-&ecirc;tre d&eacute;crit par les propri&eacute;t&eacute;s suivantes :
						</p>
						<ul>
							<li>C'est une surface droite (pas de mur courbe).</li>
							<li>Pour &ecirc;tre consid&eacute;r&eacute; comme un mur, la surface doit avoir une longueur d'au moins 80cm.</li>
						</ul>
						<p>
						A partir de ces &eacute;l&eacute;ments, il a fallut trouver une m&eacute;thode pour trouver des segments sur l'image.<br />
						La solution propos&eacute;e est l'impl&eacute;mentation d'un algorithme de Hough. Cette m&eacute;thode se base sur une recherche g&eacute;om&eacute;trique. En effet, un segment est une portion de droite. Une droite peut-&ecirc;tre d&eacute;crite par l'&eacute;quation "y=a*x+b" dans un espace cart&eacute;sien, mais peut-&ecirc;tre aussi d&eacute;crite par les deux &eacute;quations "x=rho*cos(theta)" et "y=rho*sin(theta)" dans un espace polaire.<br />
						Pour fonctionner, l'algorithme se sert d'une image binaris&eacute;e. Ensuite, on explore chacun des pixels de l'image. A chaque fois qu'un pixel est blanc, on va calculer tout les couples (rho, theta) possibles (en parourant chaque degr&eacute;e pour theta) et enregistrer les r&eacute;sultats dans un accumulateur 2D. A la fin du parcours des pixels, on peut chercher dans cet accumulateur les valeurs les plus hautes. Ces derni&egrave;res repr&eacute;sentent alors les param&egrave;tres des droites pr&eacute;sentes dans l'image.
						Pour rechercher les segments, on va effectuer les &eacute;tapes suivantes dans l'ordre :
						</p>
						<ol>
							<li>Rechercher la plus grande valeur de l'accumulateur</li>
							<li>Tracer cette droite dans l'image</li>
							<li>Faire un "ET" entre cette droite et l'image d'origine afin de d&eacute;tecter les pixels formant le(s) segment(s) sur cette doite</li>
							<li>Effectuer une transformation de Hough inverse avec les pixels formant les segments trouv&eacute;s afin de supprimer les valeurs de l'accumulateur</li>
							<li>Recommencer &agrave;  1. jusqu'&agrave;  ce que l'accumulateur ne pr&eacute;sente plus de valeurs significatives</li>
						</ol>
						Les segments ainsi trouv&eacute;s sont les murs pr&eacute;sents dans l'ar&egrave;ne.
						<h4>Vectorisation des murs</h4>
						<p>
						Afin de palier aux erreurs de mesures des capteurs et de rem&eacute;dier aux approximations des calculs de la m&eacute;thode (accumulateur discret), les murs trouv&eacute;s sont "vectoris&eacute;s". Cet abus de langage signifie que nous allons chercher &agrave;  les aligner sur une grille virtuelle repr&eacute;sentant en r&eacute;alit&eacute; une grille de un m&egrave;tre de pas. Ce pas a &eacute;t&eacute; choisi puisque l'ar&egrave;ne finale est fabriqu&eacute; de mani&egrave;re &agrave;  s'aligner dans la majeure partie des cas sur ce pas.<br />
						Pour aligner les murs virtuels, on fait deux op&eacute;rations sur chacun d'eux. Tout d'abord, on &eacute;tudie leur direction. Si elle est proche de 0, 90, 180 ou 360 degr&eacute;es, alors on la change arbitrairement &agrave;  la valeur la plus proche. Ensuite, si une des extremit&eacute;s est proche d'un noeud de la grille, alors on d&eacute;place cette extremit&eacute; sur l'intersection. Ainsi les murs deviennent align&eacute;s avec la grille et la carte devient corrig&eacute;e g&eacute;om&eacute;triquement. Pour &eacute;viter de faire d&eacute;vier des murs naturellement "inclin&eacute;s", des seuils de tol&eacute;rances sont appliqu&eacute;s sur ces algorithmes. <br />
					</p>
					<span class="clear"></span>
				</section>
				
				<section>
					<a id="_partie_3"></a>
					<h3 class="titre">3. Recherche de zones selon des crit&egrave;res : couleurs et spatiales <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
					<p>
					Cette partie n'aura malheureusement abouti &agrave;  aucun r&eacute;sultat exploitable. En effet, ce travail a &eacute;t&eacute; fait dans un but d'exploration et sans promesse de r&eacute;ussite.<br />
					Un des premiers algorithmes de classification des objets &eacute;tait bas&eacute; sur une m&eacute;thode de regroupement en gaussienne des caract&eacute;ristiques des objets. Cette m&eacute;thode est g&eacute;n&eacute;ralisable &agrave;  d'autres buts et permet donc a priori de s&eacute;parer n'importe quel espace en clusters sous forme de gaussienne. Nous avons donc voulu l'utiliser pour r&eacute;ussir &agrave;  segmenter une image poss&egrave;dant plusieurs objets superpos&eacute;s afin de trouver des zones et donc de s&eacute;parer les objets "attach&eacute;s". Malheureusement, l'&eacute;tape de discretisation de l'image &eacute;tait tr&egrave;s consommatrice en m&eacute;moire et prenait ensuite &eacute;norm&eacute;ment de temps &agrave;  analyser. Cette m&eacute;thode a &eacute;t&eacute; essay&eacute;e pour travailler sur les couleurs (espace HSV, 3 dimensions) puis ensuite sur les couleurs ET une information spatiale (HS et XY, 4 dimensions). Quelques r&eacute;sultats montrant cette transformation sont illustr&eacute;s ci-dessous. Dans l'ordre nous avons l'image originale, le traitement en utilisant uniquement la couleur (HSV) puis le m&ecirc;me traitement en servant de la couleur (H et S) et l'espace (X et Y).
					</p>
					<p id="zonespic">
						<img src="images/zones.png" alt="image originale"/>
						<img src="images/zonesHSV.png" alt="zones HSV"/>
						<img src="images/zonesHSXY.png" alt="zones HS+XY"/>
					</p>
				</section>
				
				<section>
					<a id="_partie_4"></a>
					<h3 class="titre">4. Extraction des sols et murs en 3D <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
					<p>
					Lors du dernier mois avant la comp&eacute;tition, il a &eacute;t&eacute; d&eacute;cid&eacute; de se pencher sur l'analyse des textures des sols et des murs afin de remporter des points suppl&eacute;mentaires (10% de la note finale sur cette &eacute;preuve). Pour cela, il fallait tout d'abord extraire les sols et les cloisons des nuages 3D afin de pouvoir reconstruire des images 2D avec uniquement ces zones.
					</p>
					<img id="texturespic" src="images/textures.png" alt="illustrations textures"/>
					<h4>Extraction des sols</h4>
					<p>
					La proc&eacute;dure de segmentation du sol est assez simple. Il nous suffit de regarder l'altitude des points du nuage et de ne conserver que ceux qui sont en dessous d'un certain seuil. Ensuite, une image 2D est reconstruite &agrave;  partir des points restants. Cette image est ensuite analys&eacute;e pour d&eacute;terminer les textures qui sont dessus.
					</p>
					<h4>Extraction des murs</h4>
					<p>
					L'extraction des murs est un peu plus d&eacute;licate. Lorsque la Kinect prend une photo de son environnement, un fichier XML contenant la position et l'orientation du robot est cr&eacute;&eacute; et lui est associ&eacute;. Gr&acirc;ce &agrave;  ce fichier, les points du nuage peuvent-&ecirc;tre repositionn&eacute;s dans un rep&egrave;re "carte" qui peut-&ecirc;tre associ&eacute; &agrave;  celui de la carte g&eacute;n&eacute;r&eacute;e en 2 dimensions par le LIDAR. Une fois ce recalage effectu&eacute;, chaque point 3D va &ecirc;tre &eacute;tudi&eacute; pour d&eacute;terminer s'il est sur un mur ou non gr&acirc;ce &agrave;  la carte. Ensuite, comme pour les sols, les points conserv&eacute;s servent &agrave;  g&eacute;n&eacute;rer une vue 2D. Cette derni&egrave;re sera alors analys&eacute;e pour trouver les textures qui la compose.
					</p>
					<h4>D&eacute;termination de la texture</h4>
					<p>
					Une fois que la vue d'ensemble est recr&eacute;&eacute; en 2D, on la d&eacute;coupe en vignette de 80 par 80 pixels. On a ainsi 8*6 vignettes par capture Kinect (qui font 640*480 pixels). On a choisi 80 puisque c'est un diviseur commun de 640 et 480 et il repr&eacute;sente une taille suffisamment grande pour obtenir des informations et suffisamment petite pour ne pas risquer d'avoir de nombreuses textures en m&ecirc;me temps dans la vignette.
					Afin de pouvoir conclure sur la texture, plusieurs param&egrave;tres sont observ&eacute;s :
					</p>
					<ul>
						<li>La couleur moyenne (3 dimensions)</li>
						<li>La dispersion de la couleur (3 dimensions)</li>
						<li>La couleur moyenne du Local Binary Pattern (LBP) (3 dimensions)</li>
						<li>La dispersion de la couleur moyenne du LBP (3 dimensions)</li>
					</ul>
					<p>
					Cet ensemble de param&egrave;tres forme un espace &agrave;  12 dimensions. Cet espace est s&eacute;par&eacute; en zones gr&acirc;ce &agrave;  une base de donn&eacute;es d'apprentissage. Ensuite, on observe de quelle zone s'approche le plus notre &eacute;chantillon pour conclure sur son type.
					</p>
				</section>
				
				<section>
					<a id="_partie_5"></a>
					<h3 class="titre">5. Semaine de d&eacute;fi <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
					<p>
						Pour conclure ces d&eacute;veloppements, une mise en application directe a &eacute;t&eacute; faite durant la semaine du 4 au au 8 juin 2012 pour le d&eacute;fi Carotte. Durant cette semaine, toute l'&eacute;quipe s'est r&eacute;uni sur le site de la comp&eacute;tition &agrave;  Bourges pour affronter nos comp&eacute;titeurs (quatre autres consortiums liant grandes &eacute;coles et entreprises). Certains membres de l'&eacute;quipe ont ainsi pu rencontrer les ing&eacute;nieurs, doctorants et enseignants du LORIA, venant de Nancy. Auparavant, une semaine de test a &eacute;t&eacute; effectu&eacute;e afin de peaufiner les diff&eacute;rentes t&acirc;ches, s'assurer que les robots fonctionnent correctement m&eacute;caniquement (test unitaire) et tous ensemble (test collectif, simulations de missions r&eacute;elles). Hormis un petit accident (une chute d'un robot dans les escaliers), les tests &eacute;taient dans l'ensemble concluant voire tr&egrave;s prometteur.</p>
					<p>
						Durant la semaine de comp&eacute;tition, ma mission a quelque peu chang&eacute;e. Ayant effectu&eacute; beaucoup de manipulation sur les robots (missions individuels et collectives), je suis devenu responsable du d&eacute;marrage des missions et de la restitution des donn&eacute;es. Cette t&acirc;che consiste &agrave;  la pr&eacute;paration logiciel des robots sur la ligne de d&eacute;part (V&eacute;rification de la connexion des robots au r&eacute;seau Wi-Fi, lancement d'une proc&eacute;dure logiciel de v&eacute;rification du mat&eacute;riel, d&eacute;marrage du protocole d'execution des missions) puis a ex&eacute;cuter les restitutions de donn&eacute;es lors du retour des robots en fin d'exploration. Pour les phases finales, ce dernier point &eacute;tait effectu&eacute; par un membre du jury pour assurer aucune triche. Je n'avais donc qu'&agrave;  m'assurer qu'il cliquait aux bons endroits (bien que les logiciels cr&eacute;&eacute;s pour l'occasion ne donnait pas beaucoupe de place pour une erreur).
					</p>
					<p>
						Comme expliqu&eacute; dans l'introduction, cette semaine fut tr&egrave;s concluante pour l'&eacute;quipe puisque nous avons termin&eacute; premier du challenge. Cette victoire devrait ainsi augmenter la visibilit&eacute; des laboratoires du LISA et du LORIA aupr&egrave;s de grands organismes de recherches. Le concours et les trois ann&eacute;es de recherches ont aussi &eacute;t&eacute; l'occasion d'&eacute;crire des publications scientifiques et de d&eacute;poser un brevet.
					</p>
				</section>
				
				<section>
					<a id="_partie_6"></a>
					<h3 class="titre">6. Autres travaux <a href="#_top"><img src="images/top.png" alt="top"/></a></h3>
					<h4>Apr&egrave;s le concours</h4>
					<p>
						Une fois le concours termin&eacute;, ma mission principale s'est achev&eacute;e. Cependant, le travail n'est pas termin&eacute;. En effet, certains points peuvent &ecirc;tre am&eacute;lior&eacute; et des id&eacute;es sont apparus pendant et apr&egrave;s le concours. J'ai donc commenc&eacute; &agrave;  travailler sur certains aspects de la planification de trajectoire afin d'optimiser les d&eacute;placements du robot. Ce travail n'en est qu'&agrave;  une premi&egrave;re phase de recherche sur l'&eacute;tat de l'art et la faisabilit&eacute; des concepts qui ont &eacute;t&eacute; trouv&eacute;. Je ne peux donc pas d&eacute;tailler plus cette nouvelle mission au moment d'&eacute;criture de ce site.
					</p>
					<h4>Vulgarisation de la science</h4>
					<p>
					Lors de mon stage au sein du LISA, j'ai &eacute;t&eacute; sensibilis&eacute; aux diff&eacute;rentes missions d'un enseignant-chercheur. Parmis celles-ci se trouve la vulgarisation de la science vers l'ext&eacute;rieur. En effet, le r&agrave;´le d'un chercheur est aussi de faire connaitre son activit&eacute; et de partager son savoir. Dans ce cadre, j'ai particip&eacute; &agrave;  l'organisation d'activit&eacute;s "fus&eacute;e &agrave;  eau" aupr&egrave;s d'enfants d'une &eacute;cole primaire. L'utilisation du pr&eacute;texte de l'activit&eacute; permet ainsi de faire d&eacute;couvrir et appliquer des concepts simples aux enfants tels que la notion de pression dans une bouteille, de pouss&eacute;e gr&acirc;ce &agrave;  l'eau et de trajectoire avec les ailerons.
					</p>
				</section>
			</div>
			<footer>
				<hr />
				<ul>
					<li><a href="http://www.univ-angers.fr/"><img src="images/UnivAngers.png" title="Universit&eacute; d'Angers" alt="Logo de l'universit&eacute; d'Angers"/></a></li>
					<li><a href="http://www.istia.univ-angers.fr/"><img src="images/LogoIstia.png" title="Institut des Sciences et Techniques de l'Ing&eacute;nieur de l'universit&eacute; d'Angers" alt="Logo de l'ISTIA"/></a></li>
					<li><a href="http://www.istia.univ-angers.fr/LISA/"><img src="images/logolisa.png" title="Laboratoire d'Ing&eacute;nierie des Syst&egrave;mes Automatis&eacute;s" alt="Logo du LISA"/></a></li>
				</ul>
			</footer>
		</div>
    </body>
</html>
